[{"id":1,"title":"Capire di quali dati la gente ha bisogno","output":"<p>Dobbiamo iniziare un rilascio esplorando i bisogni delle persone che li utilizzeranno, e come le professioni e le competenze che producono quei dati si possono inserire nelle loro attività. Ogni utente che otterrà un vantaggio dal riuso sarà un vantaggio per chi ha rilasciato quel dato; se quell’utente appartiene alla stessa struttura che ha rilasciato quel dato allora sarà un successo. Le esigenze delle persone sono troppo importanti per essere vincolate a silos o strutture amministrative rigide: definire un rapporto sulle proprie fondamenta conoscitive - i dati - è la forma collavorativa più produttiva. Condividere e testare continuamente è il miglior modo per essere sinceri e affidabili nel tempo.</p>\n\n<h4 id=\"lista-di-controllo\">lista di controllo</h4>\n<ol>\n  <li>All’inizio del progetto di rilascio, prendetevi del tempo per capire di quali dati avete bisogno voi</li>\n  <li>Non dmenticate la vostra storia: i dati più significativi sono quelli che raccontano la strada che avete fatto</li>\n  <li>Utilizzate dei metodi di ricerca qualitativa e quantitativa per individuare gli obiettivi delle persone, i bisogni e i comportamenti; state sempre attenti a quanto tempo ci impiegate</li>\n  <li>Rilasciate subito dei prototipi di dataset per testarli subito con le persone</li>\n  <li>Documentate ogni risultato su obiettivi, preferenze e bisogni degli utenti e condivideteli con la squadra e con la dirigenza</li>\n  <li>L’elenco per priorità delle attività di un utente che vuole realizzare sarà una storia che ciameremo <strong>user story</strong> (non importa che l’utente sia interno o esterno al vostro gruppo) </li>\n  <li>Ogni <strong>user story</strong> deve essere composta da <em>soggetto / verbo / oggetto</em> (Maria deve vedere quanti bus passano sotto casa) per verificare facilmente la soddisfazione dei bisogni</li>\n</ol>\n\n<h4 id=\"domande-chiave\">domande chiave</h4>\n<ul>\n  <li>Quali dati possono rilasciare subito?</li>\n  <li>Quanto tempo ci impiego a rilasciarli?</li>\n  <li>A chi potrebbero interessare?</li>\n  <li>Quanti dati raccontano la mia storia e quello che conosco?</li>\n  <li>Quali sono i miei utenti primari?</li>\n  <li>Quali persone potranno avere difficoltà con i miei dati?</li>\n  <li>Come faranno gli utenti a trovare i miei dati?</li>\n  <li>Quanto spesso riuscirò a documentare le tecniche di riuso e le specifiche dei dati?</li>\n</ul>\n\n","content":"Dobbiamo iniziare un rilascio esplorando i bisogni delle persone che li utilizzeranno, e come le professioni e le competenze che producono quei dati si possono inserire nelle loro attività. Ogni utente che otterrà un vantaggio dal riuso sarà un vantaggio per chi ha rilasciato quel dato; se quell'utente appartiene alla stessa struttura che ha rilasciato quel dato allora sarà un successo. Le esigenze delle persone sono troppo importanti per essere vincolate a silos o strutture amministrative rigide: definire un rapporto sulle proprie fondamenta conoscitive - i dati - è la forma collavorativa più produttiva. Condividere e testare continuamente è il miglior modo per essere sinceri e affidabili nel tempo.\n\n#### lista di controllo\n1. All'inizio del progetto di rilascio, prendetevi del tempo per capire di quali dati avete bisogno voi\n2. Non dmenticate la vostra storia: i dati più significativi sono quelli che raccontano la strada che avete fatto\n3. Utilizzate dei metodi di ricerca qualitativa e quantitativa per individuare gli obiettivi delle persone, i bisogni e i comportamenti; state sempre attenti a quanto tempo ci impiegate\n4. Rilasciate subito dei prototipi di dataset per testarli subito con le persone\n5. Documentate ogni risultato su obiettivi, preferenze e bisogni degli utenti e condivideteli con la squadra e con la dirigenza\n6. L'elenco per priorità delle attività di un utente che vuole realizzare sarà una storia che ciameremo **user story** (non importa che l'utente sia interno o esterno al vostro gruppo) \n7. Ogni **user story** deve essere composta da *soggetto / verbo / oggetto* (Maria deve vedere quanti bus passano sotto casa) per verificare facilmente la soddisfazione dei bisogni\n\n#### domande chiave\n- Quali dati possono rilasciare subito?\n- Quanto tempo ci impiego a rilasciarli?\n- A chi potrebbero interessare?\n- Quanti dati raccontano la mia storia e quello che conosco?\n- Quali sono i miei utenti primari?\n- Quali persone potranno avere difficoltà con i miei dati?\n- Come faranno gli utenti a trovare i miei dati?\n- Quanto spesso riuscirò a documentare le tecniche di riuso e le specifiche dei dati?\n\n\n\n\n\n\n","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/01.md","relative_path":"_plays/01.md","url":"/plays/01.html","collection":"plays"},{"id":2,"title":"Indirizzare l'esperienza dall'inizio alla fine","output":"<p>Abbiamo bisogno di capire i diversi modi gli utenti interagiscono con i nostri servizi, comprese le azioni che intraprendono in linea, attraverso un’applicazione mobile, su un telefono o di persona. Ogni incontro - che si tratti di linea o fuori linea - dovrebbe spostare l’utente più vicino verso il loro obiettivo.</p>\n\n<h4 id=\"lista-di-controllo\">Lista di controllo</h4>\n<ol>\n  <li>Understand the different points at which people will interact with the service – both online and in person</li>\n  <li>Identify pain points in the current way users interact with the service, and prioritize these according to user needs</li>\n  <li>Design the digital parts of the service so that they are integrated with the offline touch points people use to interact with the service</li>\n  <li>Develop metrics that will measure how well the service is meeting user needs at each step of the service</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>What are the different ways (both online and offline) that people currently accomplish the task the digital service is designed to help with?</li>\n  <li>Where are user pain points in the current way people accomplish the task?</li>\n  <li>Where does this specific project fit into the larger way people currently obtain the service being offered?</li>\n  <li>What metrics will best indicate how well the service is working for its users?</li>\n</ul>\n\n<p>Comprendere i diversi punti in cui gli utenti interagiscono con il servizio - sia online che di persona\nIdentificare i punti deboli nel modo attuale gli utenti interagiscono con il servizio, e dare priorità queste in base alle esigenze degli utenti\nProgettare le parti digitali del servizio in modo che essi sono integrati con il tocco offline points persone utilizzano per interagire con il servizio\nSviluppare metriche che misureranno quanto bene il servizio è soddisfare le esigenze degli utenti in ogni fase del servizio\ndomande chiave\nQuali sono i diversi modi (online e offline), che le persone attualmente compiono il compito del servizio digitale è stato progettato per aiutare con?\nDove sono i punti utente dolore nel popolo attuali modo realizzare il compito?\nDa dove viene questo specifico progetto rientra in modo in cui le persone più grandi attualmente ottenere il servizio offerto?\nQuali parametri saranno meglio indicare come bene il servizio sta funzionando per i suoi utenti?</p>\n","content":"Abbiamo bisogno di capire i diversi modi gli utenti interagiscono con i nostri servizi, comprese le azioni che intraprendono in linea, attraverso un'applicazione mobile, su un telefono o di persona. Ogni incontro - che si tratti di linea o fuori linea - dovrebbe spostare l'utente più vicino verso il loro obiettivo.\n\n#### Lista di controllo\n1. Understand the different points at which people will interact with the service – both online and in person\n2. Identify pain points in the current way users interact with the service, and prioritize these according to user needs\n3. Design the digital parts of the service so that they are integrated with the offline touch points people use to interact with the service\n4. Develop metrics that will measure how well the service is meeting user needs at each step of the service\n\n\n#### key questions\n- What are the different ways (both online and offline) that people currently accomplish the task the digital service is designed to help with?\n- Where are user pain points in the current way people accomplish the task?\n- Where does this specific project fit into the larger way people currently obtain the service being offered?\n- What metrics will best indicate how well the service is working for its users?\n\n\n\nComprendere i diversi punti in cui gli utenti interagiscono con il servizio - sia online che di persona\nIdentificare i punti deboli nel modo attuale gli utenti interagiscono con il servizio, e dare priorità queste in base alle esigenze degli utenti\nProgettare le parti digitali del servizio in modo che essi sono integrati con il tocco offline points persone utilizzano per interagire con il servizio\nSviluppare metriche che misureranno quanto bene il servizio è soddisfare le esigenze degli utenti in ogni fase del servizio\ndomande chiave\nQuali sono i diversi modi (online e offline), che le persone attualmente compiono il compito del servizio digitale è stato progettato per aiutare con?\nDove sono i punti utente dolore nel popolo attuali modo realizzare il compito?\nDa dove viene questo specifico progetto rientra in modo in cui le persone più grandi attualmente ottenere il servizio offerto?\nQuali parametri saranno meglio indicare come bene il servizio sta funzionando per i suoi utenti?\n","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/02.md","relative_path":"_plays/02.md","url":"/plays/02.html","collection":"plays"},{"id":3,"title":"Fare semplice e intuitivo","output":"<p>Using a government service shouldn’t be stressful, confusing, or daunting. It’s our job to build services that are simple and intuitive enough that users succeed the first time, unaided.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>Create or use an existing, simple, and flexible design style guide for the service</li>\n  <li>Use the design style guide consistently for related digital services</li>\n  <li>Give users clear information about where they are in each step of the process</li>\n  <li>Follow accessibility best practices to ensure all people can use the service</li>\n  <li>Provide users with a way to exit and return later to complete the process</li>\n  <li>Use language that is familiar to the user and easy to understand</li>\n  <li>Use language and design consistently throughout the service, including online and offline touch points</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>What primary tasks are the user trying to accomplish?</li>\n  <li>Is the language as plain and universal as possible?</li>\n  <li>What languages is your service offered in?</li>\n  <li>If a user needs help while using the service, how do they go about getting it?</li>\n  <li>How does the service’s design visually relate to other government services?</li>\n</ul>\n\n<p>Utilizzando un servizio di governo non dovrebbe essere stressante, confusione, o scoraggiante. E ‘il nostro compito di costruire servizi che sono semplici e abbastanza intuitiva che gli utenti riescono per la prima volta, senza aiuto.Lista di controllo\nCreare o utilizzare una guida di stile di disegno esistente, semplice e flessibile per il servizio\nUtilizzare sempre la guida stile di disegno per i servizi digitali connessi\nFornire agli utenti informazioni chiare su dove si trovano in ogni fase del processo\nSeguire le procedure di accessibilità per garantire tutte le persone possono utilizzare il servizio\nFornire agli utenti un modo per uscire e tornare più tardi per completare il processo\nUtilizzare un linguaggio che è familiare per l’utente e facile da capire\nUtilizzare un linguaggio e design coerente in tutta il servizio, compresi online e offline punti di contatto\ndomande chiave\nQuali compiti primari sono l’utente cercando di realizzare?\nÈ il linguaggio come semplice e universale possibile?\nQuali sono le lingue è il vostro servizio offerto in?\nSe un utente ha bisogno di aiuto durante l’utilizzo del servizio, come fanno a fare per ottenere che?\nIn che modo il design del servizio riguardano visivamente ad altri servizi pubblici?</p>\n","content":"Using a government service shouldn’t be stressful, confusing, or daunting. It’s our job to build services that are simple and intuitive enough that users succeed the first time, unaided.\n\n#### checklist\n1. Create or use an existing, simple, and flexible design style guide for the service\n2. Use the design style guide consistently for related digital services\n3. Give users clear information about where they are in each step of the process\n4. Follow accessibility best practices to ensure all people can use the service\n5. Provide users with a way to exit and return later to complete the process\n6. Use language that is familiar to the user and easy to understand\n7. Use language and design consistently throughout the service, including online and offline touch points\n\n#### key questions\n- What primary tasks are the user trying to accomplish?\n- Is the language as plain and universal as possible?\n- What languages is your service offered in?\n- If a user needs help while using the service, how do they go about getting it?\n- How does the service’s design visually relate to other government services?\n\nUtilizzando un servizio di governo non dovrebbe essere stressante, confusione, o scoraggiante. E 'il nostro compito di costruire servizi che sono semplici e abbastanza intuitiva che gli utenti riescono per la prima volta, senza aiuto.Lista di controllo\nCreare o utilizzare una guida di stile di disegno esistente, semplice e flessibile per il servizio\nUtilizzare sempre la guida stile di disegno per i servizi digitali connessi\nFornire agli utenti informazioni chiare su dove si trovano in ogni fase del processo\nSeguire le procedure di accessibilità per garantire tutte le persone possono utilizzare il servizio\nFornire agli utenti un modo per uscire e tornare più tardi per completare il processo\nUtilizzare un linguaggio che è familiare per l'utente e facile da capire\nUtilizzare un linguaggio e design coerente in tutta il servizio, compresi online e offline punti di contatto\ndomande chiave\nQuali compiti primari sono l'utente cercando di realizzare?\nÈ il linguaggio come semplice e universale possibile?\nQuali sono le lingue è il vostro servizio offerto in?\nSe un utente ha bisogno di aiuto durante l'utilizzo del servizio, come fanno a fare per ottenere che?\nIn che modo il design del servizio riguardano visivamente ad altri servizi pubblici?\n","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/03.md","relative_path":"_plays/03.md","url":"/plays/03.html","collection":"plays"},{"id":4,"title":"Costruire il servizio usando pratiche agili e interattive","output":"<p>We should use an incremental, fast-paced style of software development to reduce the risk of failure. We want to get working software into users’ hands as early as possible to give the design and development team opportunities to adjust based on user feedback about the service. A critical capability is being able to automatically test and deploy the service so that new features can be added often and be put into production easily.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>Ship a functioning “minimum viable product” (MVP) that solves a core user need as soon as possible, no longer than three months from the beginning of the project, using a “beta” or “test” period if needed</li>\n  <li>Run usability tests frequently to see how well the service works and identify improvements that should be made</li>\n  <li>Ensure the individuals building the service communicate closely using techniques such as launch meetings, war rooms, daily standups, and team chat tools</li>\n  <li>Keep delivery teams small and focused; limit organizational layers that separate these teams from the business owners</li>\n  <li>Release features and improvements multiple times each month</li>\n  <li>Create a prioritized list of features and bugs, also known as the “feature backlog” and “bug backlog”</li>\n  <li>Use a source code version control system</li>\n  <li>Give the entire project team access to the issue tracker and version control system</li>\n  <li>Use code reviews to ensure quality</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>How long did it take to ship the MVP? If it hasn’t shipped yet, when will it?</li>\n  <li>How long does it take for a production deployment?</li>\n  <li>How many days or weeks are in each iteration/sprint?</li>\n  <li>Which version control system is being used?</li>\n  <li>How are bugs tracked and tickets issued? What tool is used?</li>\n  <li>How is the feature backlog managed? What tool is used?</li>\n  <li>How often do you review and reprioritize the feature and bug backlog?</li>\n  <li>How do you collect user feedback during development? How is that feedback used to improve the service?</li>\n  <li>At each stage of usability testing, which gaps were identified in addressing user needs?</li>\n</ul>\n\n<p>Dovremmo usare un incrementale, stile frenetico di sviluppo del software per ridurre il rischio di fallimento. Vogliamo ottenere il software nelle mani degli utenti a lavorare il più presto possibile per dare ai team di progettazione e sviluppo di opportunità per regolare in base al feedback degli utenti sul servizio. Una capacità critica è essere in grado di testare e implementare il servizio in modo che le nuove funzionalità possono essere aggiunte e spesso essere messe in produzione facilmente automaticamente.Lista di controllo\nSpedire un funzionamento “minimum viable product” (MVP) che risolve un utente nucleo bisogno il più presto possibile, non oltre tre mesi dall’inizio del progetto, utilizzando una “beta” o periodo di “test” se necessario\nTest di usabilità passano frequentemente per vedere come funziona il servizio e individuare i miglioramenti da apportare\nAssicurarsi che gli individui costruiscono il servizio comunicano strettamente utilizzando tecniche come le riunioni di lancio, camere di guerra, Sagome quotidiane e strumenti squadra di chat\nMantenere squadre di consegna piccolo e concentrato; limitare i livelli organizzativi che separano queste squadre dai proprietari di imprese\nRilasciare funzionalità e miglioramenti più volte al mese\nCreare un elenco prioritario di funzioni e bug, noto anche come il “caratteristica arretrato” e “arretrato bug”\nUtilizzare un sistema di controllo di versione del codice sorgente\nDare l’intero team di progetto di accesso al sistema di issue tracker e il controllo delle versioni\nUsa il codice del cliente per garantire la qualità\ndomande chiave\nQuanto tempo ci è voluto per spedire il MVP? Se non è ancora spedito, quando lo farà?\nQuanto tempo ci vuole per una distribuzione di produzione?\nQuanti giorni o settimane sono in ogni iterazione / sprint?\nQuale sistema di controllo della versione viene utilizzato?\nCome vengono monitorati i bug e biglietti emessi? Quale strumento viene utilizzato?\nCome viene gestita l’arretrato funzione? Quale strumento viene utilizzato?\nQuanto spesso rivedere e ristabilire le priorità la funzionalità e bug arretrato?\nCome si fa a raccogliere il feedback degli utenti durante lo sviluppo? Come è che il feedback utilizzato per migliorare il servizio?\nIn ogni fase di test di usabilità, che le lacune sono stati identificati nel soddisfare le esigenze degli utenti?</p>\n","content":"We should use an incremental, fast-paced style of software development to reduce the risk of failure. We want to get working software into users’ hands as early as possible to give the design and development team opportunities to adjust based on user feedback about the service. A critical capability is being able to automatically test and deploy the service so that new features can be added often and be put into production easily.\n\n#### checklist\n1. Ship a functioning “minimum viable product” (MVP) that solves a core user need as soon as possible, no longer than three months from the beginning of the project, using a “beta” or “test” period if needed\n2. Run usability tests frequently to see how well the service works and identify improvements that should be made\n3. Ensure the individuals building the service communicate closely using techniques such as launch meetings, war rooms, daily standups, and team chat tools\n4. Keep delivery teams small and focused; limit organizational layers that separate these teams from the business owners\n5. Release features and improvements multiple times each month\n6. Create a prioritized list of features and bugs, also known as the “feature backlog” and “bug backlog”\n7. Use a source code version control system\n8. Give the entire project team access to the issue tracker and version control system\n9. Use code reviews to ensure quality\n\n\n#### key questions\n- How long did it take to ship the MVP? If it hasn't shipped yet, when will it?\n- How long does it take for a production deployment?\n- How many days or weeks are in each iteration/sprint?\n- Which version control system is being used?\n- How are bugs tracked and tickets issued? What tool is used?\n- How is the feature backlog managed? What tool is used?\n- How often do you review and reprioritize the feature and bug backlog?\n- How do you collect user feedback during development? How is that feedback used to improve the service?\n- At each stage of usability testing, which gaps were identified in addressing user needs?\n\n\nDovremmo usare un incrementale, stile frenetico di sviluppo del software per ridurre il rischio di fallimento. Vogliamo ottenere il software nelle mani degli utenti a lavorare il più presto possibile per dare ai team di progettazione e sviluppo di opportunità per regolare in base al feedback degli utenti sul servizio. Una capacità critica è essere in grado di testare e implementare il servizio in modo che le nuove funzionalità possono essere aggiunte e spesso essere messe in produzione facilmente automaticamente.Lista di controllo\nSpedire un funzionamento \"minimum viable product\" (MVP) che risolve un utente nucleo bisogno il più presto possibile, non oltre tre mesi dall'inizio del progetto, utilizzando una \"beta\" o periodo di \"test\" se necessario\nTest di usabilità passano frequentemente per vedere come funziona il servizio e individuare i miglioramenti da apportare\nAssicurarsi che gli individui costruiscono il servizio comunicano strettamente utilizzando tecniche come le riunioni di lancio, camere di guerra, Sagome quotidiane e strumenti squadra di chat\nMantenere squadre di consegna piccolo e concentrato; limitare i livelli organizzativi che separano queste squadre dai proprietari di imprese\nRilasciare funzionalità e miglioramenti più volte al mese\nCreare un elenco prioritario di funzioni e bug, noto anche come il \"caratteristica arretrato\" e \"arretrato bug\"\nUtilizzare un sistema di controllo di versione del codice sorgente\nDare l'intero team di progetto di accesso al sistema di issue tracker e il controllo delle versioni\nUsa il codice del cliente per garantire la qualità\ndomande chiave\nQuanto tempo ci è voluto per spedire il MVP? Se non è ancora spedito, quando lo farà?\nQuanto tempo ci vuole per una distribuzione di produzione?\nQuanti giorni o settimane sono in ogni iterazione / sprint?\nQuale sistema di controllo della versione viene utilizzato?\nCome vengono monitorati i bug e biglietti emessi? Quale strumento viene utilizzato?\nCome viene gestita l'arretrato funzione? Quale strumento viene utilizzato?\nQuanto spesso rivedere e ristabilire le priorità la funzionalità e bug arretrato?\nCome si fa a raccogliere il feedback degli utenti durante lo sviluppo? Come è che il feedback utilizzato per migliorare il servizio?\nIn ogni fase di test di usabilità, che le lacune sono stati identificati nel soddisfare le esigenze degli utenti?\n","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/04.md","relative_path":"_plays/04.md","url":"/plays/04.html","collection":"plays"},{"id":5,"title":"Strutturare i bilanci e i contratti per supportare la consegna","output":"<p>To improve our chances of success when contracting out development work, we need to work with experienced budgeting and contracting officers. In cases where we use third parties to help build a service, a well-defined contract can facilitate good development practices like conducting a research and prototyping phase, refining product requirements as the service is built, evaluating open source alternatives, ensuring frequent delivery milestones, and allowing the flexibility to purchase cloud computing resources.</p>\n\n<p><a href=\"https://playbook.cio.gov/techfar/\">The TechFAR Handbook</a> provides a detailed explanation of the flexibilities in the Federal Acquisition Regulation (FAR) that can help agencies implement this play.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>Budget includes research, discovery, and prototyping activities</li>\n  <li>Contract is structured to request frequent deliverables, not multi-month milestones</li>\n  <li>Contract is structured to hold vendors accountable to deliverables</li>\n  <li>Contract gives the government delivery team enough flexibility to adjust feature prioritization and delivery schedule as the project evolves</li>\n  <li>Contract ensures open source solutions are evaluated when technology choices are made</li>\n  <li>Contract specifies that software and data generated by third parties remains under our control, and can be reused and released to the public as appropriate and in accordance with the law</li>\n  <li>Contract allows us to use tools, services, and hosting from vendors with a variety of pricing models, including fixed fees and variable models like “pay-for-what-you-use” services</li>\n  <li>Contract specifies a warranty period where defects uncovered by the public are addressed by the vendor at no additional cost to the government</li>\n  <li>Contract includes a transition of services period and transition-out plan</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>What is the scope of the project? What are the key deliverables?</li>\n  <li>What are the milestones? How frequent are they?</li>\n  <li>What are the performance metrics defined in the contract (e.g., response time, system uptime, time period to address priority issues)?</li>\n</ul>\n\n<p>Per migliorare le nostre possibilità di successo quando subappalto il lavoro di sviluppo, abbiamo bisogno di lavorare con gli ufficiali di budgeting e contraenti esperti. Nei casi in cui usiamo i terzi per aiutare a costruire un servizio, un contratto ben definito può facilitare le buone pratiche di sviluppo come lo svolgimento di un progetto di ricerca e prototipazione di fase, i requisiti di prodotto di raffinazione come il servizio è costruito, valutando alternative open source, garantendo le tappe di consegna frequenti, e consentendo la flessibilità di acquistare le risorse di cloud computing.Il TechFAR manuale fornisce una spiegazione dettagliata delle flessibilità nel Federal Acquisition Regulation (FAR) che possono aiutare le agenzie di implementare questo gioco.Lista di controllo\nBilancio comprende la ricerca, la scoperta, e le attività di prototipazione\nContratto è strutturato in modo da richiedere deliverable frequenti, non pietre miliari più mesi\nContratto è strutturato in modo da contenere i fornitori responsabili di deliverable\nContratto dà al governo squadra di consegna abbastanza flessibilità per regolare funzione delle priorità e orario di consegna come si evolve progetto\nContratto garantisce soluzioni open source vengono valutati quando scelte tecnologiche sono fatti\nContratto specifica che il software e dati generati da terzi, rimane sotto il nostro controllo, e possono essere riutilizzati e rilasciato al pubblico, se del caso e in conformità con la legge\nContratto ci permette di utilizzare strumenti, servizi, e hosting dai fornitori con una varietà di modelli di pricing, comprese le spese fisse e variabili, come i modelli “pay-per-what-you-use” servizi\nContratto specifica un periodo di garanzia in cui i difetti scoperti dal pubblico vengono affrontate dal venditore senza alcun costo aggiuntivo per il governo\nContratto prevede una transizione di periodo di servizi e piano di transizione-out\ndomande chiave\nQual è la portata del progetto? Quali sono i prodotti essenziali?\nQuali sono le tappe fondamentali? Come frequenti sono?\nQuali sono le metriche di performance definiti nel contratto (ad esempio, il tempo di risposta, uptime del sistema, periodo di tempo per affrontare questioni prioritarie)?</p>\n","content":"To improve our chances of success when contracting out development work, we need to work with experienced budgeting and contracting officers. In cases where we use third parties to help build a service, a well-defined contract can facilitate good development practices like conducting a research and prototyping phase, refining product requirements as the service is built, evaluating open source alternatives, ensuring frequent delivery milestones, and allowing the flexibility to purchase cloud computing resources.\n\n[The TechFAR Handbook](https://playbook.cio.gov/techfar/) provides a detailed explanation of the flexibilities in the Federal Acquisition Regulation (FAR) that can help agencies implement this play.\n\n#### checklist\n1. Budget includes research, discovery, and prototyping activities\n2. Contract is structured to request frequent deliverables, not multi-month milestones\n3. Contract is structured to hold vendors accountable to deliverables\n4. Contract gives the government delivery team enough flexibility to adjust feature prioritization and delivery schedule as the project evolves\n5. Contract ensures open source solutions are evaluated when technology choices are made\n6. Contract specifies that software and data generated by third parties remains under our control, and can be reused and released to the public as appropriate and in accordance with the law\n7. Contract allows us to use tools, services, and hosting from vendors with a variety of pricing models, including fixed fees and variable models like “pay-for-what-you-use” services\n8. Contract specifies a warranty period where defects uncovered by the public are addressed by the vendor at no additional cost to the government\n9. Contract includes a transition of services period and transition-out plan\n\n#### key questions\n- What is the scope of the project? What are the key deliverables?\n- What are the milestones? How frequent are they?\n- What are the performance metrics defined in the contract (e.g., response time, system uptime, time period to address priority issues)?\n\n\nPer migliorare le nostre possibilità di successo quando subappalto il lavoro di sviluppo, abbiamo bisogno di lavorare con gli ufficiali di budgeting e contraenti esperti. Nei casi in cui usiamo i terzi per aiutare a costruire un servizio, un contratto ben definito può facilitare le buone pratiche di sviluppo come lo svolgimento di un progetto di ricerca e prototipazione di fase, i requisiti di prodotto di raffinazione come il servizio è costruito, valutando alternative open source, garantendo le tappe di consegna frequenti, e consentendo la flessibilità di acquistare le risorse di cloud computing.Il TechFAR manuale fornisce una spiegazione dettagliata delle flessibilità nel Federal Acquisition Regulation (FAR) che possono aiutare le agenzie di implementare questo gioco.Lista di controllo\nBilancio comprende la ricerca, la scoperta, e le attività di prototipazione\nContratto è strutturato in modo da richiedere deliverable frequenti, non pietre miliari più mesi\nContratto è strutturato in modo da contenere i fornitori responsabili di deliverable\nContratto dà al governo squadra di consegna abbastanza flessibilità per regolare funzione delle priorità e orario di consegna come si evolve progetto\nContratto garantisce soluzioni open source vengono valutati quando scelte tecnologiche sono fatti\nContratto specifica che il software e dati generati da terzi, rimane sotto il nostro controllo, e possono essere riutilizzati e rilasciato al pubblico, se del caso e in conformità con la legge\nContratto ci permette di utilizzare strumenti, servizi, e hosting dai fornitori con una varietà di modelli di pricing, comprese le spese fisse e variabili, come i modelli \"pay-per-what-you-use\" servizi\nContratto specifica un periodo di garanzia in cui i difetti scoperti dal pubblico vengono affrontate dal venditore senza alcun costo aggiuntivo per il governo\nContratto prevede una transizione di periodo di servizi e piano di transizione-out\ndomande chiave\nQual è la portata del progetto? Quali sono i prodotti essenziali?\nQuali sono le tappe fondamentali? Come frequenti sono?\nQuali sono le metriche di performance definiti nel contratto (ad esempio, il tempo di risposta, uptime del sistema, periodo di tempo per affrontare questioni prioritarie)?","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/05.md","relative_path":"_plays/05.md","url":"/plays/05.html","collection":"plays"},{"id":6,"title":"Assegnare un leader e tenere conto di questa persona","output":"<p>There must be a single product owner who has the authority and responsibility to assign tasks and work elements; make business, product, and technical decisions; and be accountable for the success or failure of the overall service. This product owner is ultimately responsible for how well the service meets needs of its users, which is how a service should be evaluated. The product owner is responsible for ensuring that features are built and managing the feature and bug backlogs.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>A product owner has been identified</li>\n  <li>All stakeholders agree that the product owner has the authority to assign tasks and make decisions about features and technical implementation details</li>\n  <li>The product owner has a product management background with technical experience to assess alternatives and weigh tradeoffs</li>\n  <li>The product owner has a work plan that includes budget estimates and identifies funding sources</li>\n  <li>The product owner has a strong relationship with the contracting officer</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>Who is the product owner?</li>\n  <li>What organizational changes have been made to ensure the product owner has sufficient authority over and support for the project?</li>\n  <li>What does it take for the product owner to add or remove a feature from the service?</li>\n</ul>\n\n<p>Ci deve essere un proprietario unico prodotto che ha l’autorità e la responsabilità di assegnare compiti e gli elementi di lavoro; fare business, di prodotto, e decisioni tecniche; ed essere responsabili per il successo o il fallimento del servizio complessivo. Questo proprietario del prodotto è il responsabile ultimo per quanto bene il servizio soddisfa le esigenze degli utenti, che è come un servizio deve essere valutata. Il proprietario del prodotto è responsabile di assicurare che le caratteristiche sono costruiti e gestione delle funzionalità e bug arretrati.Lista di controllo\nÈ stato identificato un proprietario del prodotto\nTutte le parti interessate concordano sul fatto che il proprietario del prodotto ha l’autorità di assegnare compiti e prendere decisioni su caratteristiche e dettagli tecnici di implementazione\nIl proprietario del prodotto ha uno sfondo product management con esperienza tecnica per valutare le alternative e pesare compromessi\nIl proprietario del prodotto ha un piano di lavoro che include le previsioni di bilancio e individua le fonti di finanziamento\nIl proprietario del prodotto ha una forte relazione con l’ufficiale appaltante\ndomande chiave\nChi è il proprietario del prodotto?\nQuali cambiamenti organizzativi sono stati fatti per assicurare il proprietario del prodotto è sufficiente autorità sopra e il sostegno al progetto?\nCosa ci vuole per il proprietario del prodotto per aggiungere o rimuovere una funzione dal servizio?</p>\n","content":"There must be a single product owner who has the authority and responsibility to assign tasks and work elements; make business, product, and technical decisions; and be accountable for the success or failure of the overall service. This product owner is ultimately responsible for how well the service meets needs of its users, which is how a service should be evaluated. The product owner is responsible for ensuring that features are built and managing the feature and bug backlogs.\n\n#### checklist\n1. A product owner has been identified\n2. All stakeholders agree that the product owner has the authority to assign tasks and make decisions about features and technical implementation details\n3. The product owner has a product management background with technical experience to assess alternatives and weigh tradeoffs\n4. The product owner has a work plan that includes budget estimates and identifies funding sources\n5. The product owner has a strong relationship with the contracting officer\n\n#### key questions\n- Who is the product owner?\n- What organizational changes have been made to ensure the product owner has sufficient authority over and support for the project?\n- What does it take for the product owner to add or remove a feature from the service?\n\n\nCi deve essere un proprietario unico prodotto che ha l'autorità e la responsabilità di assegnare compiti e gli elementi di lavoro; fare business, di prodotto, e decisioni tecniche; ed essere responsabili per il successo o il fallimento del servizio complessivo. Questo proprietario del prodotto è il responsabile ultimo per quanto bene il servizio soddisfa le esigenze degli utenti, che è come un servizio deve essere valutata. Il proprietario del prodotto è responsabile di assicurare che le caratteristiche sono costruiti e gestione delle funzionalità e bug arretrati.Lista di controllo\nÈ stato identificato un proprietario del prodotto\nTutte le parti interessate concordano sul fatto che il proprietario del prodotto ha l'autorità di assegnare compiti e prendere decisioni su caratteristiche e dettagli tecnici di implementazione\nIl proprietario del prodotto ha uno sfondo product management con esperienza tecnica per valutare le alternative e pesare compromessi\nIl proprietario del prodotto ha un piano di lavoro che include le previsioni di bilancio e individua le fonti di finanziamento\nIl proprietario del prodotto ha una forte relazione con l'ufficiale appaltante\ndomande chiave\nChi è il proprietario del prodotto?\nQuali cambiamenti organizzativi sono stati fatti per assicurare il proprietario del prodotto è sufficiente autorità sopra e il sostegno al progetto?\nCosa ci vuole per il proprietario del prodotto per aggiungere o rimuovere una funzione dal servizio?\n","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/06.md","relative_path":"_plays/06.md","url":"/plays/06.html","collection":"plays"},{"id":7,"title":"Crea un team esperto","output":"<p>We need talented people working in government who have experience creating modern digital services. This includes bringing in seasoned product managers, engineers, and designers. When outside help is needed, our teams should work with contracting officers who understand how to evaluate third-party technical competency so our teams can be paired with contractors who are good at both building and delivering effective digital services. The makeup and experience requirements of the team will vary depending on the scope of the project.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>Member(s) of the team have experience building popular, high-traffic digital services</li>\n  <li>Member(s) of the team have experience designing mobile and web applications</li>\n  <li>Member(s) of the team have experience using automated testing frameworks</li>\n  <li>Member(s) of the team have experience with modern development and operations (DevOps) techniques like continuous integration and continuous deployment</li>\n  <li>Member(s) of the team have experience securing digital services</li>\n  <li>A Federal contracting officer is on the internal team if a third party will be used for development work</li>\n  <li>A Federal budget officer is on the internal team or is a partner</li>\n  <li>The appropriate privacy, civil liberties, and/or legal advisor for the department or agency is a partner</li>\n</ol>\n\n<p>Abbiamo bisogno di persone di talento che lavorano nel governo che hanno esperienza nella creazione di servizi digitali moderni. Ciò include portando in manager esperti di prodotto, ingegneri e progettisti. Quando è necessario un aiuto esterno, le nostre squadre devono lavorare con gli ufficiali contraenti in grado di comprendere come valutare terzi competenze tecniche in modo da i nostri team possono essere abbinati con gli appaltatori che sono bravi a entrambi costruzione e fornitura di servizi digitali efficienti. I requisiti di trucco e di esperienza del team variano a seconda della portata del progetto.Lista di controllo\nMembro (s) del team ha esperienza nella costruzione di hotel, i servizi digitali ad alto traffico\nMembro (s) del team hanno esperienza nella progettazione di applicazioni mobile e web\nMembro (s), della squadra ha esperienza utilizzando framework di test automatizzato\nMembro (s) del team ha esperienza con lo sviluppo e le operazioni (DevOps) tecniche come l’integrazione continua e implementazione continua moderno\nMembro (s) del team hanno esperienza garantire servizi digitali\nUn ufficiale federale contraente è il team interno se verrà utilizzata una terza parte per il lavoro di sviluppo\nUn ufficiale di bilancio federale è sul team interno o è un partner\nL’adeguata privacy, le libertà civili, e / o consulente legale per il reparto o agenzia è un partner</p>\n","content":"We need talented people working in government who have experience creating modern digital services. This includes bringing in seasoned product managers, engineers, and designers. When outside help is needed, our teams should work with contracting officers who understand how to evaluate third-party technical competency so our teams can be paired with contractors who are good at both building and delivering effective digital services. The makeup and experience requirements of the team will vary depending on the scope of the project.\n\n#### checklist\n1. Member(s) of the team have experience building popular, high-traffic digital services\n2. Member(s) of the team have experience designing mobile and web applications\n3. Member(s) of the team have experience using automated testing frameworks\n4. Member(s) of the team have experience with modern development and operations (DevOps) techniques like continuous integration and continuous deployment\n5. Member(s) of the team have experience securing digital services\n6. A Federal contracting officer is on the internal team if a third party will be used for development work\n7. A Federal budget officer is on the internal team or is a partner\n8. The appropriate privacy, civil liberties, and/or legal advisor for the department or agency is a partner\n\n\nAbbiamo bisogno di persone di talento che lavorano nel governo che hanno esperienza nella creazione di servizi digitali moderni. Ciò include portando in manager esperti di prodotto, ingegneri e progettisti. Quando è necessario un aiuto esterno, le nostre squadre devono lavorare con gli ufficiali contraenti in grado di comprendere come valutare terzi competenze tecniche in modo da i nostri team possono essere abbinati con gli appaltatori che sono bravi a entrambi costruzione e fornitura di servizi digitali efficienti. I requisiti di trucco e di esperienza del team variano a seconda della portata del progetto.Lista di controllo\nMembro (s) del team ha esperienza nella costruzione di hotel, i servizi digitali ad alto traffico\nMembro (s) del team hanno esperienza nella progettazione di applicazioni mobile e web\nMembro (s), della squadra ha esperienza utilizzando framework di test automatizzato\nMembro (s) del team ha esperienza con lo sviluppo e le operazioni (DevOps) tecniche come l'integrazione continua e implementazione continua moderno\nMembro (s) del team hanno esperienza garantire servizi digitali\nUn ufficiale federale contraente è il team interno se verrà utilizzata una terza parte per il lavoro di sviluppo\nUn ufficiale di bilancio federale è sul team interno o è un partner\nL'adeguata privacy, le libertà civili, e / o consulente legale per il reparto o agenzia è un partner\n","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/07.md","relative_path":"_plays/07.md","url":"/plays/07.html","collection":"plays"},{"id":8,"title":"Scegli un pacchetto di tecnologie moderne","output":"<p>The technology decisions we make need to enable development teams to work efficiently and enable services to scale easily and cost-effectively. Our choices for hosting infrastructure, databases, software frameworks, programming languages and the rest of the technology stack should seek to avoid vendor lock-in and match what successful modern consumer and enterprise software companies would choose today. In particular, digital services teams should consider using open source, cloud-based, and commodity solutions across the technology stack, because of their widespread adoption and support by successful consumer and enterprise technology companies in the private sector.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>Choose software frameworks that are commonly used by private-sector companies creating similar services</li>\n  <li>Whenever possible, ensure that software can be deployed on a variety of commodity hardware types</li>\n  <li>Ensure that each project has clear, understandable instructions for setting up a local development environment, and that team members can be quickly added or removed from projects</li>\n  <li><a href=\"http://www.whitehouse.gov/sites/default/files/omb/assets/egov_docs/memotociostechnologyneutrality.pdf\">Consider open source software solutions</a> at every layer of the stack</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>What is your development stack and why did you choose it?</li>\n  <li>Which databases are you using and why did you choose them?</li>\n  <li>How long does it take for a new team member to start developing?</li>\n</ul>\n\n<p>Le decisioni che prendiamo tecnologia devono consentire ai team di sviluppo a lavorare in modo efficiente e attivare i servizi di scalare in modo semplice e conveniente. Le nostre scelte per le infrastrutture di hosting, database, software framework, linguaggi di programmazione e il resto dello stack tecnologico dovrebbero cercare di evitare il vendor lock-in e corrispondere a ciò che di successo moderne società di consumo e il software enterprise sceglierebbero oggi. In particolare, i servizi digitali squadre dovrebbero considerare l’utilizzo di open source, cloud-based, e le soluzioni di materie prime in tutto il stack tecnologico, per la loro diffusa adozione e il sostegno da parte delle imprese di consumo e della tecnologia delle imprese di successo nel settore privato.Lista di controllo\nScegli framework software che vengono comunemente utilizzati dalle aziende del settore privato, creando servizi analoghi\nQuando possibile, in modo che il software può essere implementato su una varietà di tipi di hardware commodity\nAssicurarsi che ogni progetto ha istruzioni chiare e comprensibili per la creazione di un ambiente di sviluppo locale, e che i membri del team può essere rapidamente aggiunto o rimosso dai progetti\nPrendere in considerazione soluzioni software open source ad ogni livello dello stack\ndomande chiave\nQual è il tuo stack di sviluppo e perché hai scelto?\nQuali database stai usando e perché hai scelto loro?\nQuanto tempo ci vuole per un nuovo membro del team per iniziare a sviluppare?</p>\n","content":"The technology decisions we make need to enable development teams to work efficiently and enable services to scale easily and cost-effectively. Our choices for hosting infrastructure, databases, software frameworks, programming languages and the rest of the technology stack should seek to avoid vendor lock-in and match what successful modern consumer and enterprise software companies would choose today. In particular, digital services teams should consider using open source, cloud-based, and commodity solutions across the technology stack, because of their widespread adoption and support by successful consumer and enterprise technology companies in the private sector.\n\n#### checklist\n1. Choose software frameworks that are commonly used by private-sector companies creating similar services\n2. Whenever possible, ensure that software can be deployed on a variety of commodity hardware types\n3. Ensure that each project has clear, understandable instructions for setting up a local development environment, and that team members can be quickly added or removed from projects\n4. [Consider open source software solutions](http://www.whitehouse.gov/sites/default/files/omb/assets/egov_docs/memotociostechnologyneutrality.pdf) at every layer of the stack\n\n#### key questions\n- What is your development stack and why did you choose it?\n- Which databases are you using and why did you choose them?\n- How long does it take for a new team member to start developing?\n\n\nLe decisioni che prendiamo tecnologia devono consentire ai team di sviluppo a lavorare in modo efficiente e attivare i servizi di scalare in modo semplice e conveniente. Le nostre scelte per le infrastrutture di hosting, database, software framework, linguaggi di programmazione e il resto dello stack tecnologico dovrebbero cercare di evitare il vendor lock-in e corrispondere a ciò che di successo moderne società di consumo e il software enterprise sceglierebbero oggi. In particolare, i servizi digitali squadre dovrebbero considerare l'utilizzo di open source, cloud-based, e le soluzioni di materie prime in tutto il stack tecnologico, per la loro diffusa adozione e il sostegno da parte delle imprese di consumo e della tecnologia delle imprese di successo nel settore privato.Lista di controllo\nScegli framework software che vengono comunemente utilizzati dalle aziende del settore privato, creando servizi analoghi\nQuando possibile, in modo che il software può essere implementato su una varietà di tipi di hardware commodity\nAssicurarsi che ogni progetto ha istruzioni chiare e comprensibili per la creazione di un ambiente di sviluppo locale, e che i membri del team può essere rapidamente aggiunto o rimosso dai progetti\nPrendere in considerazione soluzioni software open source ad ogni livello dello stack\ndomande chiave\nQual è il tuo stack di sviluppo e perché hai scelto?\nQuali database stai usando e perché hai scelto loro?\nQuanto tempo ci vuole per un nuovo membro del team per iniziare a sviluppare?","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/08.md","relative_path":"_plays/08.md","url":"/plays/08.html","collection":"plays"},{"id":9,"title":"Distribuisci in un flessibile hosting di sviluppo","output":"<p>Our services should be deployed on flexible infrastructure, where resources can be provisioned in real-time to meet spikes traffic and user demand. Our digital services are crippled when we host them in data centers that market themselves as “cloud hosting” but require us to manage and maintain hardware directly. This outdated practice wastes time, weakens our disaster recovery plans, and results in significantly higher costs.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>Resources are provisioned on demand</li>\n  <li>Resources scale based on real-time user demand</li>\n  <li>Resources are provisioned through an API</li>\n  <li>Resources are available in multiple regions</li>\n  <li>We only pay for resources we use</li>\n  <li>Static assets are served through a content delivery network</li>\n  <li>Application is hosted on commodity hardware</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>Where is your service hosted?</li>\n  <li>What hardware does your service use to run?</li>\n  <li>What is the demand or usage pattern for your service?</li>\n  <li>What happens to your service when it experiences a surge in traffic or load?</li>\n  <li>How much capacity is available in your hosting environment?</li>\n  <li>How long does it take you to provision a new resource, like an application server?</li>\n  <li>How have you designed your service to scale based on demand?</li>\n  <li>How are you paying for your hosting infrastructure (e.g., by the minute, hourly, daily, monthly, fixed)?</li>\n  <li>Is your service hosted in multiple regions, availability zones, or data centers?</li>\n  <li>In the event of a catastrophic disaster to a datacenter, how long will it take to have the service operational?</li>\n  <li>What would be the impact of a prolonged downtime window?</li>\n  <li>What data redundancy do you have built into the system, and what would be the impact of a catastrophic data loss?</li>\n  <li>How often do you need to contact a person from your hosting provider to get resources or to fix an issue?</li>\n</ul>\n\n<p>I nostri servizi devono essere distribuiti su un’infrastruttura flessibile, in cui è possibile il provisioning delle risorse in tempo reale per soddisfare i picchi di traffico e la domanda degli utenti. I nostri servizi digitali sono paralizzati quando li ospitiamo nei data center che si commercializzano come “cloud hosting”, ma ci impongono di gestire e mantenere direttamente all’hardware. Questa rifiuti pratica volta superata, indebolisce i nostri piani di disaster recovery, e si traduce in costi molto più elevati.Lista di controllo\nLe risorse sono accantonati su richiesta\nScala le risorse sulla base di domanda degli utenti in tempo reale\nLe risorse sono stanziate attraverso un’API\nLe risorse sono disponibili in più regioni\nPaghiamo solo per le risorse che utilizziamo\nBeni statici sono serviti attraverso una rete di distribuzione di contenuti\nApplicazione è ospitata su hardware commodity\ndomande chiave\nDove si trova il vostro servizio ospitato?\nQuale hardware fa il tuo uso del servizio per l’esecuzione?\nQual è la domanda o modello di utilizzo per il vostro servizio?\nCosa succede al vostro servizio quando si verifica un aumento del traffico o del carico?\nQuanta capacità è disponibile nel vostro ambiente di hosting?\nQuanto tempo ti fa disposizione una nuova risorsa, come un server di applicazioni?\nCome avete progettato il servizio per scalare in base alla domanda?\nCome si sta pagando per la vostra infrastruttura di hosting (ad esempio, di minuto in minuto, ogni ora, ogni giorno, ogni mese, fisso)?\nIl vostro servizio ospitato in più regioni, zone disponibilità, o centri dati?\nIn caso di un disastro catastrofico di un datacenter, quanto tempo ci vorrà per avere il servizio operativo?\nQuale sarebbe l’impatto di una finestra di tempo di inattività prolungata?\nChe la ridondanza dei dati si fa a hanno costruito nel sistema, e quale sarebbe l’impatto di una catastrofica perdita di dati?\nQuante volte è necessario contattare una persona dal proprio fornitore di hosting per ottenere le risorse o per risolvere un problema?</p>\n","content":"Our services should be deployed on flexible infrastructure, where resources can be provisioned in real-time to meet spikes traffic and user demand. Our digital services are crippled when we host them in data centers that market themselves as “cloud hosting” but require us to manage and maintain hardware directly. This outdated practice wastes time, weakens our disaster recovery plans, and results in significantly higher costs.\n\n#### checklist\n1. Resources are provisioned on demand\n2. Resources scale based on real-time user demand\n3. Resources are provisioned through an API\n4. Resources are available in multiple regions\n5. We only pay for resources we use\n6. Static assets are served through a content delivery network\n7. Application is hosted on commodity hardware\n\n#### key questions\n-\tWhere is your service hosted?\n-\tWhat hardware does your service use to run?\n-\tWhat is the demand or usage pattern for your service?\n-\tWhat happens to your service when it experiences a surge in traffic or load?\n-\tHow much capacity is available in your hosting environment?\n-\tHow long does it take you to provision a new resource, like an application server?\n-\tHow have you designed your service to scale based on demand?\n-\tHow are you paying for your hosting infrastructure (e.g., by the minute, hourly, daily, monthly, fixed)?\n-\tIs your service hosted in multiple regions, availability zones, or data centers?\n-\tIn the event of a catastrophic disaster to a datacenter, how long will it take to have the service operational?\n-\tWhat would be the impact of a prolonged downtime window?\n-\tWhat data redundancy do you have built into the system, and what would be the impact of a catastrophic data loss?\n-\tHow often do you need to contact a person from your hosting provider to get resources or to fix an issue?\n\n\nI nostri servizi devono essere distribuiti su un'infrastruttura flessibile, in cui è possibile il provisioning delle risorse in tempo reale per soddisfare i picchi di traffico e la domanda degli utenti. I nostri servizi digitali sono paralizzati quando li ospitiamo nei data center che si commercializzano come \"cloud hosting\", ma ci impongono di gestire e mantenere direttamente all'hardware. Questa rifiuti pratica volta superata, indebolisce i nostri piani di disaster recovery, e si traduce in costi molto più elevati.Lista di controllo\nLe risorse sono accantonati su richiesta\nScala le risorse sulla base di domanda degli utenti in tempo reale\nLe risorse sono stanziate attraverso un'API\nLe risorse sono disponibili in più regioni\nPaghiamo solo per le risorse che utilizziamo\nBeni statici sono serviti attraverso una rete di distribuzione di contenuti\nApplicazione è ospitata su hardware commodity\ndomande chiave\nDove si trova il vostro servizio ospitato?\nQuale hardware fa il tuo uso del servizio per l'esecuzione?\nQual è la domanda o modello di utilizzo per il vostro servizio?\nCosa succede al vostro servizio quando si verifica un aumento del traffico o del carico?\nQuanta capacità è disponibile nel vostro ambiente di hosting?\nQuanto tempo ti fa disposizione una nuova risorsa, come un server di applicazioni?\nCome avete progettato il servizio per scalare in base alla domanda?\nCome si sta pagando per la vostra infrastruttura di hosting (ad esempio, di minuto in minuto, ogni ora, ogni giorno, ogni mese, fisso)?\nIl vostro servizio ospitato in più regioni, zone disponibilità, o centri dati?\nIn caso di un disastro catastrofico di un datacenter, quanto tempo ci vorrà per avere il servizio operativo?\nQuale sarebbe l'impatto di una finestra di tempo di inattività prolungata?\nChe la ridondanza dei dati si fa a hanno costruito nel sistema, e quale sarebbe l'impatto di una catastrofica perdita di dati?\nQuante volte è necessario contattare una persona dal proprio fornitore di hosting per ottenere le risorse o per risolvere un problema?\n","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/09.md","relative_path":"_plays/09.md","url":"/plays/09.html","collection":"plays"},{"id":10,"title":"Automatizza i test e gli sviluppi","output":"<p>Today, developers write automated scripts that can verify thousands of scenarios in minutes and then deploy updated code into production environments multiple times a day. They use automated performance tests which simulate surges in traffic to identify performance bottlenecks. While manual tests and quality assurance are still necessary, automated tests provide consistent and reliable protection against unintentional regressions, and make it possible for developers to confidently release frequent updates to the service.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>Create automated tests that verify all user-facing functionality</li>\n  <li>Create unit and integration tests to verify modules and components</li>\n  <li>Run tests automatically as part of the build process</li>\n  <li>Perform deployments automatically with deployment scripts, continuous delivery services, or similar techniques</li>\n  <li>Conduct load and performance tests at regular intervals, including before public launch</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>What percentage of the code base is covered by automated tests?</li>\n  <li>How long does it take to build, test, and deploy a typical bug fix?</li>\n  <li>How long does it take to build, test, and deploy a new feature into production?</li>\n  <li>How frequently are builds created?</li>\n  <li>What test tools are used?</li>\n  <li>Which deployment automation or continuous integration tools are used?</li>\n  <li>What is the estimated maximum number of concurrent users who will want to use the system?</li>\n  <li>How many simultaneous users could the system handle, according to the most recent capacity test?</li>\n  <li>How does the service perform when you exceed the expected target usage volume? Does it degrade gracefully or catastrophically?</li>\n  <li>What is your scaling strategy when demand increases suddenly?</li>\n</ul>\n\n<p>Oggi, gli sviluppatori scrivono script automatizzati che possono verificare migliaia di scenari in pochi minuti e poi distribuire codice aggiornato in ambienti di produzione più volte al giorno. Usano i test automatici di performance che simulano picchi nel traffico per identificare i colli di bottiglia delle prestazioni. Mentre i test manuali e garanzia della qualità sono ancora necessari, test automatici forniscono una protezione coerente e affidabile contro regressioni non intenzionali, e consentono agli sviluppatori di rilasciare fiducia frequenti aggiornamenti al servizio.Lista di controllo\nCreare test automatizzati che verificano tutte le funzionalità user-di fronte\nCreare test di unità e di integrazione per verificare moduli e componenti\nEseguire automaticamente i test come parte del processo di generazione\nEseguire implementazioni automaticamente script di distribuzione, servizi di consegna continui, o tecniche analoghe\nCondurre prove di carico e di prestazioni a intervalli regolari, anche prima del lancio pubblico\ndomande chiave\nQual è la percentuale della base di codice è coperto da test automatizzati?\nQuanto tempo ci vuole per costruire, testare e distribuire una tipica correzione di bug?\nQuanto tempo ci vuole per costruire, testare e implementare una nuova funzionalità in produzione?\nCon quale frequenza vengono build creato?\nQuali sono gli strumenti di prova vengono utilizzati?\nQuali automazione distribuzione o strumenti di integrazione continui vengono utilizzati?\nQual è il numero massimo stimato di utenti concorrenti che vorranno utilizzare il sistema?\nQuanti utenti simultanei potrebbe gestire il sistema, secondo il test di capacità più recente?\nCome funziona il servizio esegue quando viene superato il volume di utilizzo di destinazione previsto? Ha degrada con grazia o catastroficamente?\nQual è la vostra strategia di scala quando la domanda aumenta improvvisamente?</p>\n","content":"Today, developers write automated scripts that can verify thousands of scenarios in minutes and then deploy updated code into production environments multiple times a day. They use automated performance tests which simulate surges in traffic to identify performance bottlenecks. While manual tests and quality assurance are still necessary, automated tests provide consistent and reliable protection against unintentional regressions, and make it possible for developers to confidently release frequent updates to the service.\n\n#### checklist\n1. Create automated tests that verify all user-facing functionality\n2. Create unit and integration tests to verify modules and components\n3. Run tests automatically as part of the build process\n4. Perform deployments automatically with deployment scripts, continuous delivery services, or similar techniques\n5. Conduct load and performance tests at regular intervals, including before public launch\n\n\n#### key questions\n- What percentage of the code base is covered by automated tests?\n- How long does it take to build, test, and deploy a typical bug fix?\n- How long does it take to build, test, and deploy a new feature into production?\n- How frequently are builds created?\n- What test tools are used?\n- Which deployment automation or continuous integration tools are used?\n- What is the estimated maximum number of concurrent users who will want to use the system?\n- How many simultaneous users could the system handle, according to the most recent capacity test?\n- How does the service perform when you exceed the expected target usage volume? Does it degrade gracefully or catastrophically?\n- What is your scaling strategy when demand increases suddenly?\n\n\nOggi, gli sviluppatori scrivono script automatizzati che possono verificare migliaia di scenari in pochi minuti e poi distribuire codice aggiornato in ambienti di produzione più volte al giorno. Usano i test automatici di performance che simulano picchi nel traffico per identificare i colli di bottiglia delle prestazioni. Mentre i test manuali e garanzia della qualità sono ancora necessari, test automatici forniscono una protezione coerente e affidabile contro regressioni non intenzionali, e consentono agli sviluppatori di rilasciare fiducia frequenti aggiornamenti al servizio.Lista di controllo\nCreare test automatizzati che verificano tutte le funzionalità user-di fronte\nCreare test di unità e di integrazione per verificare moduli e componenti\nEseguire automaticamente i test come parte del processo di generazione\nEseguire implementazioni automaticamente script di distribuzione, servizi di consegna continui, o tecniche analoghe\nCondurre prove di carico e di prestazioni a intervalli regolari, anche prima del lancio pubblico\ndomande chiave\nQual è la percentuale della base di codice è coperto da test automatizzati?\nQuanto tempo ci vuole per costruire, testare e distribuire una tipica correzione di bug?\nQuanto tempo ci vuole per costruire, testare e implementare una nuova funzionalità in produzione?\nCon quale frequenza vengono build creato?\nQuali sono gli strumenti di prova vengono utilizzati?\nQuali automazione distribuzione o strumenti di integrazione continui vengono utilizzati?\nQual è il numero massimo stimato di utenti concorrenti che vorranno utilizzare il sistema?\nQuanti utenti simultanei potrebbe gestire il sistema, secondo il test di capacità più recente?\nCome funziona il servizio esegue quando viene superato il volume di utilizzo di destinazione previsto? Ha degrada con grazia o catastroficamente?\nQual è la vostra strategia di scala quando la domanda aumenta improvvisamente?\n","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/10.md","relative_path":"_plays/10.md","url":"/plays/10.html","collection":"plays"},{"id":11,"title":"Gestire la sicurezza e la privacy attraverso i processi","output":"<p>Our digital services have to protect sensitive information and keep systems secure. This is typically a process of continuous review and improvement which should be built into the development and maintenance of the service. At the start of designing a new service or feature, the team lead should engage the appropriate privacy, security, and legal officer(s) to discuss the type of information collected, how it should be secured, how long it is kept, and how it may be used and shared. The sustained engagement of a privacy specialist helps ensure that personal data is properly managed. In addition, a key process to building a secure service is comprehensively testing and certifying the components in each layer of the technology stack for security vulnerabilities, and then to re-use these same pre-certified components for multiple services.</p>\n\n<p>The following checklist provides a starting point, but teams should work closely with their privacy specialist and security engineer to meet the needs of the specific service.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>Contact the appropriate privacy or legal officer of the department or agency to determine whether a System of Records Notice (SORN), Privacy Impact Assessment, or other review should be conducted</li>\n  <li>Determine, in consultation with a records officer, what data is collected and why, how it is used or shared, how it is stored and secured, and how long it is kept</li>\n  <li>Determine, in consultation with a privacy specialist, whether and how users are notified about how personal information is collected and used, including whether a privacy policy is needed and where it should appear, and how users will be notified in the event of a security breach</li>\n  <li>Consider whether the user should be able to access, delete, or remove their information from the service</li>\n  <li>“Pre-certify” the hosting infrastructure used for the project using FedRAMP</li>\n  <li>Use deployment scripts to ensure configuration of production environment remains consistent and controllable</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>Does the service collect personal information from the user?  How is the user notified of this collection?</li>\n  <li>Does it collect more information than necessary? Could the data be used in ways an average user wouldn’t expect?</li>\n  <li>How does a user access, correct, delete, or remove personal information?</li>\n  <li>Will any of the personal information stored in the system be shared with other services, people, or partners?</li>\n  <li>How and how often is the service tested for security vulnerabilities?</li>\n  <li>How can someone from the public report a security issue?</li>\n</ul>\n\n<p>I nostri servizi digitali hanno per proteggere le informazioni sensibili e mantenere sicuri i sistemi. Si tratta in genere di un processo di continua revisione e miglioramento che dovrebbe essere costruito nello sviluppo e mantenimento del servizio. All’inizio della progettazione di un nuovo servizio o funzione, il team leader dovrebbe impegnarsi privacy appropriata, la sicurezza, e giurista (s) per discutere il tipo di informazioni raccolte, come dovrebbe essere assicurato, per quanto tempo si è mantenuto, e in che modo esso può essere utilizzato e condiviso. L’impegno costante di uno specialista di privacy aiuta a garantire che i dati personali è gestito correttamente. Inoltre, un processo chiave per costruire un servizio sicuro è ampiamente testando e la certificazione delle componenti in ogni strato dello stack tecnologico per vulnerabilità di sicurezza, e quindi di riutilizzare questi stessi componenti pre-certificato per più servizi.La seguente lista di controllo fornisce un punto di partenza, ma i team dovrebbe lavorare a stretto contatto con il loro specialista privacy e ingegnere della sicurezza per soddisfare le esigenze del servizio specifico.Lista di controllo\nContattare la privacy appropriata o funzionario legale del dipartimento o agenzia per determinare se un sistema di registrazione Avviso (SORN), Privacy Impact Assessment, o altra revisione deve essere condotta\nStabilire, in consultazione con un ufficiale di record, quali dati vengono raccolti e perché, come vengono utilizzati o condivisi, modalità di conservazione e protetto, e per quanto tempo si è mantenuto\nStabilire, in consultazione con uno specialista di privacy, se e come gli utenti vengono informati su come le informazioni personali vengono raccolte e usate, compreso se è necessaria una politica di privacy e dove dovrebbe apparire, e in che modo gli utenti saranno informati in caso di una violazione della sicurezza\nConsiderare se l’utente dovrebbe essere in grado di accedere, cancellare o rimuovere le proprie informazioni dal servizio\n“Pre-certificare” l’infrastruttura di hosting utilizzato per il progetto utilizzando FedRAMP\nUtilizzare script di distribuzione per garantire la configurazione dell’ambiente di produzione rimane coerente e controllabile\ndomande chiave\nHa il servizio raccoglie informazioni personali da parte dell’utente? Come l’utente avvisato di questa collezione?\nHa raccogliere più informazioni del necessario? Potrebbe i dati essere utilizzato in modi un utente medio non si aspetta?\nCome fa un utente l’accesso, rettifica, eliminare o rimuovere le informazioni personali?\nQualcuno di informazioni personali memorizzate nel sistema essere condivisi con altri servizi, persone, o partner?\nCome e con quale frequenza è il servizio di test per vulnerabilità di sicurezza?\nCome può qualcuno dalla relazione pubblica un problema di sicurezza?</p>\n","content":"Our digital services have to protect sensitive information and keep systems secure. This is typically a process of continuous review and improvement which should be built into the development and maintenance of the service. At the start of designing a new service or feature, the team lead should engage the appropriate privacy, security, and legal officer(s) to discuss the type of information collected, how it should be secured, how long it is kept, and how it may be used and shared. The sustained engagement of a privacy specialist helps ensure that personal data is properly managed. In addition, a key process to building a secure service is comprehensively testing and certifying the components in each layer of the technology stack for security vulnerabilities, and then to re-use these same pre-certified components for multiple services.\n\nThe following checklist provides a starting point, but teams should work closely with their privacy specialist and security engineer to meet the needs of the specific service.\n\n#### checklist\n1. Contact the appropriate privacy or legal officer of the department or agency to determine whether a System of Records Notice (SORN), Privacy Impact Assessment, or other review should be conducted\n2. Determine, in consultation with a records officer, what data is collected and why, how it is used or shared, how it is stored and secured, and how long it is kept\n3. Determine, in consultation with a privacy specialist, whether and how users are notified about how personal information is collected and used, including whether a privacy policy is needed and where it should appear, and how users will be notified in the event of a security breach\n4. Consider whether the user should be able to access, delete, or remove their information from the service\n5. “Pre-certify” the hosting infrastructure used for the project using FedRAMP\n6. Use deployment scripts to ensure configuration of production environment remains consistent and controllable\n\n#### key questions\n- Does the service collect personal information from the user?  How is the user notified of this collection?\n- Does it collect more information than necessary? Could the data be used in ways an average user wouldn't expect?\n- How does a user access, correct, delete, or remove personal information?\n- Will any of the personal information stored in the system be shared with other services, people, or partners?\n- How and how often is the service tested for security vulnerabilities?\n- How can someone from the public report a security issue?\n\n\nI nostri servizi digitali hanno per proteggere le informazioni sensibili e mantenere sicuri i sistemi. Si tratta in genere di un processo di continua revisione e miglioramento che dovrebbe essere costruito nello sviluppo e mantenimento del servizio. All'inizio della progettazione di un nuovo servizio o funzione, il team leader dovrebbe impegnarsi privacy appropriata, la sicurezza, e giurista (s) per discutere il tipo di informazioni raccolte, come dovrebbe essere assicurato, per quanto tempo si è mantenuto, e in che modo esso può essere utilizzato e condiviso. L'impegno costante di uno specialista di privacy aiuta a garantire che i dati personali è gestito correttamente. Inoltre, un processo chiave per costruire un servizio sicuro è ampiamente testando e la certificazione delle componenti in ogni strato dello stack tecnologico per vulnerabilità di sicurezza, e quindi di riutilizzare questi stessi componenti pre-certificato per più servizi.La seguente lista di controllo fornisce un punto di partenza, ma i team dovrebbe lavorare a stretto contatto con il loro specialista privacy e ingegnere della sicurezza per soddisfare le esigenze del servizio specifico.Lista di controllo\nContattare la privacy appropriata o funzionario legale del dipartimento o agenzia per determinare se un sistema di registrazione Avviso (SORN), Privacy Impact Assessment, o altra revisione deve essere condotta\nStabilire, in consultazione con un ufficiale di record, quali dati vengono raccolti e perché, come vengono utilizzati o condivisi, modalità di conservazione e protetto, e per quanto tempo si è mantenuto\nStabilire, in consultazione con uno specialista di privacy, se e come gli utenti vengono informati su come le informazioni personali vengono raccolte e usate, compreso se è necessaria una politica di privacy e dove dovrebbe apparire, e in che modo gli utenti saranno informati in caso di una violazione della sicurezza\nConsiderare se l'utente dovrebbe essere in grado di accedere, cancellare o rimuovere le proprie informazioni dal servizio\n\"Pre-certificare\" l'infrastruttura di hosting utilizzato per il progetto utilizzando FedRAMP\nUtilizzare script di distribuzione per garantire la configurazione dell'ambiente di produzione rimane coerente e controllabile\ndomande chiave\nHa il servizio raccoglie informazioni personali da parte dell'utente? Come l'utente avvisato di questa collezione?\nHa raccogliere più informazioni del necessario? Potrebbe i dati essere utilizzato in modi un utente medio non si aspetta?\nCome fa un utente l'accesso, rettifica, eliminare o rimuovere le informazioni personali?\nQualcuno di informazioni personali memorizzate nel sistema essere condivisi con altri servizi, persone, o partner?\nCome e con quale frequenza è il servizio di test per vulnerabilità di sicurezza?\nCome può qualcuno dalla relazione pubblica un problema di sicurezza?","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/11.md","relative_path":"_plays/11.md","url":"/plays/11.html","collection":"plays"},{"id":12,"title":"Usare i dati per prendere le decisioni","output":"<p>At every stage of a project, we should measure how well our service is working for our users. This includes measuring how well a system performs and how people are interacting with it in real-time. Our teams and agency leadership should carefully watch these metrics to find issues and identify which bug fixes and improvements should be prioritized. Along with monitoring tools, a feedback mechanism should be in place for people to report issues directly.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>Monitor system-level resource utilization in real time</li>\n  <li>Monitor system performance in real-time (e.g. response time, latency, throughput, and error rates)</li>\n  <li>Ensure monitoring can measure median, 95th percentile, and 98th percentile performance</li>\n  <li>Create automated alerts based on this monitoring</li>\n  <li>Track concurrent users in real-time, and monitor user behaviors in the aggregate to determine how well the service meets user needs</li>\n  <li>Publish metrics internally</li>\n  <li>Publish metrics externally</li>\n  <li>Use an experimentation tool that supports multivariate testing in production</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>What are the key metrics for the service?</li>\n  <li>How have these metrics performed over the life of the service?</li>\n  <li>Which system monitoring tools are in place?</li>\n  <li>What is the targeted average response time for your service? What percent of requests take more than 1 second, 2 seconds, 4 seconds, and 8 seconds?</li>\n  <li>What is the average response time and percentile breakdown (percent of requests taking more than 1s, 2s, 4s, and 8s) for the top 10 transactions?</li>\n  <li>What is the volume of each of your service’s top 10 transactions? What is the percentage of transactions started vs. completed?</li>\n  <li>What is your service’s monthly uptime target?</li>\n  <li>What is your service’s monthly uptime percentage, including scheduled maintenance? Excluding scheduled maintenance?</li>\n  <li>How does your team receive automated alerts when incidents occur?</li>\n  <li>How does your team respond to incidents? What is your post-mortem process?</li>\n  <li>Which tools are in place to measure user behavior?</li>\n  <li>What tools or technologies are used for A/B testing?</li>\n  <li>How do you measure customer satisfaction?</li>\n</ul>\n\n<p>In ogni fase di un progetto, dobbiamo misurare quanto bene il nostro servizio sta lavorando per i nostri utenti. Questo include misurare quanto bene un sistema esegue e come le persone interagiscono con esso in tempo reale. I nostri team e la leadership agenzia dovrebbe attentamente guardare questi parametri per trovare i problemi e identificare quali correzioni di bug e miglioramenti dovrebbero avere la priorità. Insieme a strumenti di monitoraggio, un meccanismo di feedback dovrebbe essere in atto per le persone a segnalare direttamente i problemi.Lista di controllo\nUtilizzo monitor risorse a livello di sistema in tempo reale\nSistema di monitoraggio delle prestazioni in tempo reale (ad esempio, il tempo di risposta, la latenza, i tassi di throughput e di errore)\nGarantire il monitoraggio in grado di misurare mediana, 95 ° percentile, e le prestazioni 98 ° percentile\nCreare avvisi automatizzati basati su questo monitoraggio\nTraccia utenti simultanei in tempo reale e monitorare i comportamenti degli utenti in forma aggregata per determinare quanto il servizio soddisfi le esigenze degli utenti\nPubblicare metriche internamente\nPubblicare metriche esternamente\nUtilizzare uno strumento di sperimentazione che supporta test multivariato della produzione\ndomande chiave\nQuali sono i parametri chiave per il servizio?\nCome sono queste metriche effettuato per tutta la durata del servizio?\nQuale sistema di strumenti di controllo sono in atto?\nQual è il tempo medio di risposta mirata per il vostro servizio? Qual è la percentuale di richieste di prendere più di 1 secondo, 2 secondi, 4 secondi e 8 secondi?\nQual è il tempo medio di risposta e la scomposizione percentile (per cento delle richieste che prendono più di 1s, 2s, 4s e 8s) per i primi 10 transazioni?\nQual è il volume di ciascuna delle 10 operazioni del vostro servizio? Qual è la percentuale di transazioni ha iniziato contro completato?\nQual è l’obiettivo di uptime mensile del vostro servizio?\nQual è la percentuale di uptime mensile del vostro servizio, inclusa la manutenzione programmata? Escludendo manutenzione programmata?\nIn che modo la vostra squadra ricevere avvisi automatici quando si verificano incidenti?\nIn che modo la vostra squadra risponde agli incidenti? Qual è il tuo processo di post-mortem?\nQuali strumenti sono in atto per misurare il comportamento degli utenti?\nQuali strumenti o tecnologie vengono utilizzate per il test A / B?\nCome si fa a misurare la soddisfazione del cliente?</p>\n","content":"At every stage of a project, we should measure how well our service is working for our users. This includes measuring how well a system performs and how people are interacting with it in real-time. Our teams and agency leadership should carefully watch these metrics to find issues and identify which bug fixes and improvements should be prioritized. Along with monitoring tools, a feedback mechanism should be in place for people to report issues directly.\n\n#### checklist\n1. Monitor system-level resource utilization in real time\n2. Monitor system performance in real-time (e.g. response time, latency, throughput, and error rates)\n3. Ensure monitoring can measure median, 95th percentile, and 98th percentile performance\n4. Create automated alerts based on this monitoring\n5. Track concurrent users in real-time, and monitor user behaviors in the aggregate to determine how well the service meets user needs\n6. Publish metrics internally\n7. Publish metrics externally\n8. Use an experimentation tool that supports multivariate testing in production\n\n\n#### key questions\n- What are the key metrics for the service?\n- How have these metrics performed over the life of the service?\n- Which system monitoring tools are in place?\n- What is the targeted average response time for your service? What percent of requests take more than 1 second, 2 seconds, 4 seconds, and 8 seconds?\n- What is the average response time and percentile breakdown (percent of requests taking more than 1s, 2s, 4s, and 8s) for the top 10 transactions?\n- What is the volume of each of your service’s top 10 transactions? What is the percentage of transactions started vs. completed?\n- What is your service’s monthly uptime target?\n- What is your service’s monthly uptime percentage, including scheduled maintenance? Excluding scheduled maintenance?\n- How does your team receive automated alerts when incidents occur?\n- How does your team respond to incidents? What is your post-mortem process?\n- Which tools are in place to measure user behavior?\n- What tools or technologies are used for A/B testing?\n- How do you measure customer satisfaction?\n\n\nIn ogni fase di un progetto, dobbiamo misurare quanto bene il nostro servizio sta lavorando per i nostri utenti. Questo include misurare quanto bene un sistema esegue e come le persone interagiscono con esso in tempo reale. I nostri team e la leadership agenzia dovrebbe attentamente guardare questi parametri per trovare i problemi e identificare quali correzioni di bug e miglioramenti dovrebbero avere la priorità. Insieme a strumenti di monitoraggio, un meccanismo di feedback dovrebbe essere in atto per le persone a segnalare direttamente i problemi.Lista di controllo\nUtilizzo monitor risorse a livello di sistema in tempo reale\nSistema di monitoraggio delle prestazioni in tempo reale (ad esempio, il tempo di risposta, la latenza, i tassi di throughput e di errore)\nGarantire il monitoraggio in grado di misurare mediana, 95 ° percentile, e le prestazioni 98 ° percentile\nCreare avvisi automatizzati basati su questo monitoraggio\nTraccia utenti simultanei in tempo reale e monitorare i comportamenti degli utenti in forma aggregata per determinare quanto il servizio soddisfi le esigenze degli utenti\nPubblicare metriche internamente\nPubblicare metriche esternamente\nUtilizzare uno strumento di sperimentazione che supporta test multivariato della produzione\ndomande chiave\nQuali sono i parametri chiave per il servizio?\nCome sono queste metriche effettuato per tutta la durata del servizio?\nQuale sistema di strumenti di controllo sono in atto?\nQual è il tempo medio di risposta mirata per il vostro servizio? Qual è la percentuale di richieste di prendere più di 1 secondo, 2 secondi, 4 secondi e 8 secondi?\nQual è il tempo medio di risposta e la scomposizione percentile (per cento delle richieste che prendono più di 1s, 2s, 4s e 8s) per i primi 10 transazioni?\nQual è il volume di ciascuna delle 10 operazioni del vostro servizio? Qual è la percentuale di transazioni ha iniziato contro completato?\nQual è l'obiettivo di uptime mensile del vostro servizio?\nQual è la percentuale di uptime mensile del vostro servizio, inclusa la manutenzione programmata? Escludendo manutenzione programmata?\nIn che modo la vostra squadra ricevere avvisi automatici quando si verificano incidenti?\nIn che modo la vostra squadra risponde agli incidenti? Qual è il tuo processo di post-mortem?\nQuali strumenti sono in atto per misurare il comportamento degli utenti?\nQuali strumenti o tecnologie vengono utilizzate per il test A / B?\nCome si fa a misurare la soddisfazione del cliente?","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/12.md","relative_path":"_plays/12.md","url":"/plays/12.html","collection":"plays"},{"id":13,"title":"Predefinito all'aprire","output":"<p>When we collaborate in the open and publish our data publicly, we can improve Government together. By building services more openly and publishing open data, we simplify the public’s access to government services and information, allow the public to contribute easily, and enable reuse by entrepreneurs, nonprofits, other agencies, and the public.</p>\n\n<h4 id=\"checklist\">checklist</h4>\n<ol>\n  <li>Offer users a mechanism to report bugs and issues, and be responsive to these reports</li>\n  <li>Provide datasets to the public, in their entirety, through bulk downloads and APIs (application programming interfaces)</li>\n  <li>Ensure that data from the service is explicitly in the public domain, and that rights are waived globally via an international public domain dedication, such as the “Creative Commons Zero” waiver</li>\n  <li>Catalog data in the agency’s enterprise data inventory and add any public datasets to the agency’s public data listing</li>\n  <li>Ensure that we maintain the rights to all data developed by third parties in a manner that is releasable and reusable at no cost to the public</li>\n  <li>Ensure that we maintain contractual rights to all custom software developed by third parties in a manner that is publishable and reusable at no cost</li>\n  <li>When appropriate, create an API for third parties and internal users to interact with the service directly</li>\n  <li>When appropriate, publish source code of projects or components online</li>\n  <li>When appropriate, share your development process and progress publicly</li>\n</ol>\n\n<h4 id=\"key-questions\">key questions</h4>\n<ul>\n  <li>How are you collecting user feedback for bugs and issues?</li>\n  <li>If there is an API, what capabilities does it provide? Who uses it? How is it documented?</li>\n  <li>If the codebase has not been released under an open source license, explain why.</li>\n  <li>What components are made available to the public as open source?</li>\n  <li>What datasets are made available to the public?</li>\n</ul>\n\n<p>Quando collaboriamo allo scoperto e pubblichiamo i nostri dati pubblicamente, possiamo migliorare Governo insieme. Con la costruzione di servizi più apertamente e la pubblicazione di dati aperti, semplifichiamo l’accesso del pubblico ai servizi governativi e le informazioni, permettono al pubblico di partecipare facilmente, e consentire il riutilizzo da parte di imprenditori, organizzazioni non profit, altre agenzie, e il pubblico.Lista di controllo\nOffrire agli utenti un meccanismo per segnalare bug e problemi, e di rispondere a tali relazioni\nFornire dataset al pubblico, nel loro complesso, attraverso il download di massa e le API (Application Programming Interface)\nAssicurarsi che i dati dal servizio è esplicitamente di dominio pubblico, e che i diritti sono rinunciato a livello globale attraverso un impegno di dominio pubblico internazionale, come ad esempio la rinuncia “Creative Commons Zero”\nDati di catalogo a dati aziendali inventario dell’agenzia e aggiungere eventuali dataset pubblici alla quotazione dati pubblici dell’agenzia\nAssicurare che manteniamo i diritti di tutti i dati sviluppati da terze parti in un modo che è rilasciabile e riutilizzabile senza alcun costo per il pubblico\nAssicurare che manteniamo i diritti contrattuali a tutti i software personalizzato sviluppato da terze parti in un modo che è pubblicabile e riutilizzabile a costo zero\nSe del caso, creare una API per conto terzi e agli utenti interni di interagire con il servizio direttamente\nSe del caso, pubblicare il codice sorgente di progetti o componenti on-line\nSe del caso, condividere il tuo processo di sviluppo e di progresso pubblicamente\ndomande chiave\nCome si stanno raccogliendo il feedback degli utenti per i bug e problemi?\nSe c’è un API, quali capacità fornisce? Chi la utilizza? Come è documentato?\nSe la base di codice non è stato rilasciato sotto una licenza open source, spiegare il perché.\nQuali componenti sono messi a disposizione del pubblico come open source?\nQuali set di dati sono messi a disposizione del pubblico?</p>\n","content":"When we collaborate in the open and publish our data publicly, we can improve Government together. By building services more openly and publishing open data, we simplify the public’s access to government services and information, allow the public to contribute easily, and enable reuse by entrepreneurs, nonprofits, other agencies, and the public.\n\n#### checklist\n1. Offer users a mechanism to report bugs and issues, and be responsive to these reports\n2. Provide datasets to the public, in their entirety, through bulk downloads and APIs (application programming interfaces)\n3. Ensure that data from the service is explicitly in the public domain, and that rights are waived globally via an international public domain dedication, such as the “Creative Commons Zero” waiver\n4. Catalog data in the agency’s enterprise data inventory and add any public datasets to the agency’s public data listing\n5. Ensure that we maintain the rights to all data developed by third parties in a manner that is releasable and reusable at no cost to the public\n6. Ensure that we maintain contractual rights to all custom software developed by third parties in a manner that is publishable and reusable at no cost\n7. When appropriate, create an API for third parties and internal users to interact with the service directly\n8. When appropriate, publish source code of projects or components online\n9. When appropriate, share your development process and progress publicly\n\n#### key questions\n- How are you collecting user feedback for bugs and issues?\n- If there is an API, what capabilities does it provide? Who uses it? How is it documented?\n- If the codebase has not been released under an open source license, explain why.\n- What components are made available to the public as open source?\n- What datasets are made available to the public?\n\n\nQuando collaboriamo allo scoperto e pubblichiamo i nostri dati pubblicamente, possiamo migliorare Governo insieme. Con la costruzione di servizi più apertamente e la pubblicazione di dati aperti, semplifichiamo l'accesso del pubblico ai servizi governativi e le informazioni, permettono al pubblico di partecipare facilmente, e consentire il riutilizzo da parte di imprenditori, organizzazioni non profit, altre agenzie, e il pubblico.Lista di controllo\nOffrire agli utenti un meccanismo per segnalare bug e problemi, e di rispondere a tali relazioni\nFornire dataset al pubblico, nel loro complesso, attraverso il download di massa e le API (Application Programming Interface)\nAssicurarsi che i dati dal servizio è esplicitamente di dominio pubblico, e che i diritti sono rinunciato a livello globale attraverso un impegno di dominio pubblico internazionale, come ad esempio la rinuncia \"Creative Commons Zero\"\nDati di catalogo a dati aziendali inventario dell'agenzia e aggiungere eventuali dataset pubblici alla quotazione dati pubblici dell'agenzia\nAssicurare che manteniamo i diritti di tutti i dati sviluppati da terze parti in un modo che è rilasciabile e riutilizzabile senza alcun costo per il pubblico\nAssicurare che manteniamo i diritti contrattuali a tutti i software personalizzato sviluppato da terze parti in un modo che è pubblicabile e riutilizzabile a costo zero\nSe del caso, creare una API per conto terzi e agli utenti interni di interagire con il servizio direttamente\nSe del caso, pubblicare il codice sorgente di progetti o componenti on-line\nSe del caso, condividere il tuo processo di sviluppo e di progresso pubblicamente\ndomande chiave\nCome si stanno raccogliendo il feedback degli utenti per i bug e problemi?\nSe c'è un API, quali capacità fornisce? Chi la utilizza? Come è documentato?\nSe la base di codice non è stato rilasciato sotto una licenza open source, spiegare il perché.\nQuali componenti sono messi a disposizione del pubblico come open source?\nQuali set di dati sono messi a disposizione del pubblico?\n","path":"/Users/lucacorsato/Documents/osd/website/playbook/_plays/13.md","relative_path":"_plays/13.md","url":"/plays/13.html","collection":"plays"}]
